{
    "data": {
        "query": "angular",
        "body": {
            "Error": "0",
            "Time": 0.0199,
            "Total": "9",
            "Page": 1,
            "Books": [
                {
                    "ID": 4122728448,
                    "Title": "Getting MEAN with Mongo, Express, Angular, and Node",
                    "Description": "Traditional web dev stacks use a different programming language in every layer, resulting in a complex mashup of code and frameworks. Together, the MongoDB database, the Express and AngularJS frameworks, and Node.js constitute the MEAN stacku2014a powe ...",
                    "Image": "http://s.it-ebooks-api.info/5/getting_mean_with_mongo_express_angular_and_node.jpg",
                    "isbn": "9781617292033"
                },
                {
                    "ID": 3202804470,
                    "Title": "Pro TypeScript",
                    "SubTitle": "Application-Scale JavaScript Development",
                    "Description": "JavaScript is everywhere, both as a pure language and in popular libraries like Angular, jQuery and Knockout, but users of modern object-oriented languages like Java and C# often find JavaScript frustrating to use and hard to extend to large-scale ap ...",
                    "Image": "http://s.it-ebooks-api.info/6/pro_typescript.jpg",
                    "isbn": "9781430267911"
                },
                {
                    "ID": 3625738736,
                    "Title": "AngularJS: Novice to Ninja",
                    "SubTitle": "Elegant, Powerful, Testable, Extendable",
                    "Description": "AngularJS: Novice to Ninja is the perfect book to journey into the world of AngularJS, the superheroic JavaScript framework. Developed and maintained by Google, AngularJS brings the Model-View-Controller (MVC) pattern to JavaScript applications and p ...",
                    "Image": "http://s.it-ebooks-api.info/7/angularjs_novice_to_ninja.jpg",
                    "isbn": "9780992279455"
                },
                {
                    "ID": 1957971290,
                    "Title": "AngularJS by Example",
                    "SubTitle": "Learn AngularJS, and tackle the challenges of modern web development by creating your own applications with these practical examples you can use and adapt",
                    "Description": "AngularJS makes web JavaScript web development less painful and more organized u2013 it's unsurprising that today it's one of the most popular tools in web development.nnAngularJS by Example helps you get started with this essential web development f ...",
                    "Image": "http://s.it-ebooks-api.info/14/angularjs_by_example.jpg",
                    "isbn": "9781783553815"
                },
                {
                    "ID": 2152247293,
                    "Title": "AngularJS Directives Cookbook",
                    "SubTitle": "Extend the capabilities of AngularJS and build dynamic web applications by creating customized directives with this selection of more than 30 recipes",
                    "Description": "AngularJS directives are at the center of what makes it such an exciting u2013 and important - web development framework. With directives, you can take greater control over HTML elements on your web pages u2013 they u2018direct' Angular's HTML compiler to ...",
                    "Image": "http://s.it-ebooks-api.info/14/angularjs_directives_cookbook.jpg",
                    "isbn": "9781784395896"
                },
                {
                    "ID": 3960039562,
                    "Title": "Mastering MeteorJS Application Development",
                    "SubTitle": "MeteorJS makes full-stack JavaScript Application Development simple u2013 Learn how to build better modern web apps with MeteorJS, and become an expert in the innovative JavaScript framework",
                    "Description": "The web is dead u2013 applications now rule our online experiences. But how are you going to build them? Well, if you've been paying attention, you might already have tried your hand with MeteorJS, the JavaScript framework that helps you build complete ...",
                    "Image": "http://s.it-ebooks-api.info/14/mastering_meteorjs_application_development.jpg",
                    "isbn": "9781785282379"
                },
                {
                    "ID": 217336290,
                    "Title": "Rails, Angular, Postgres, and Bootstrap",
                    "SubTitle": "Powerful, Effective, and Efficient Full-Stack Web Development",
                    "Description": "As a Rails developer, you care about user experience and performance, but you also want simple and maintainable code. Achieve all that by embracing the full stack of web development, from styling with Bootstrap, building an interactive user interface ...",
                    "Image": "http://s.it-ebooks-api.info/1/rails_angular_postgres_and_bootstrap.jpg",
                    "isbn": "9781680501261"
                },
                {
                    "ID": 4238085813,
                    "Title": "AngularJS in Action",
                    "Description": "AngularJS is a JavaScript-based framework that extends HTML, so you can create dynamic, interactive web applications in the same way you create standard static pages. Out of the box, Angular provides most of the functionality you'll need for basic ap ...",
                    "Image": "http://s.it-ebooks-api.info/5/angularjs_in_action.jpg",
                    "isbn": "9781617291333"
                },
                {
                    "ID": 1916744333,
                    "Title": "Material Design implementation with AngularJS",
                    "SubTitle": "UI Component Framework",
                    "Description": "Building web and mobile apps that are interactive, fluid and provide consistent experience across devices ranging from desktops, tablets and smart phones is challenging. User Interface (UI) elements need to adapt to various screen sizes and yet the c ...",
                    "Image": "http://s.it-ebooks-api.info/6/material_design_implementation_with_angularjs.jpg",
                    "isbn": "9781484221891"
                }
            ]
        }
    }
}